//=========================================================
/* const newAlert = alert("Type any...."); //andefined
console.log(newAlert); */
//=========================================================
/* const numder = prompt("Type number");
console.log(numder); //повертає текстовий рядок введений користувчем */
//=========================================================
/* const newConfirm = confirm("Are you sh....?");
console.log(newConfirm); // повертає буль T/F */
//========================================================
// Запропонуйте користувачу ввести число за допомогою prompt().

// Збережіть введене значення у змінну number.

// Перевірте, чи дорівнює змінна number числу 10:

//    Якщо так – виведіть повідомлення 'Вірно' у alert().

//    Якщо ні – виведіть 'Невірно'.

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою
// перетворіть значення на число за допомогою Number().
//+++++++++++++++++ Task 1+++++++++++++++++++
/* const numder = Number(prompt("Type number"));
console.log(numder);
if (numder === 10) {
  alert("Ok");
} else {
  alert("Oooooops");
} */

//+++++++++++++++++++Task 2 +++++++++++++++++++
// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"

/* const min = Math.floor(Math.random() * 59);
if (min < 15) {
  alert(`${min} 1st quter`);
} else if (min <= 30) {
  alert(`${min} 2nd quter`);
} else if (min <= 45) {
  alert(`${min} 3d quter`);
} else if (min <= 59) {
  alert(`${min} 4d quter`);
} else {
  alert(`${min} Noooooo`);
} */
//+++++++++++++++++++Task 3 +++++++++++++++++++
// Змінна num може набувати 4 значення: '1', '2', '3' або '4'
// (запитуй це значення у користувача через prompt).
// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.
// Розв'яжіть завдання через switch-case.
// Не забудьте про дефолтне значення, на випадок, якщо користувач
// введе в prompt щось інше. В такому випадку result має набувати значення:
// "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// Значення змінної result виведіть в консоль.

/* const number = Number(prompt("input 1-4"));
let result;
switch (number) {
  case 1:
    result = "Winter";
    break;
  case 2:
    result = "Spring";
    break;
  case 3:
    result = "Summer";
    break;
  case 4:
    result = "Outem";
    break;
  default:
    result = "asdasdasdas";
}
console.log(result);
 */
//+++++++++++++++++++Task 4 +++++++++++++++++++

// Отримуйте від користувача число (кількість хвилин) через prompt
// і виводьте у консоль рядок у форматі годин та хвилин.
// Приклад: користувач вводить в prompt '70' -> в консолі відобразиться '01:10'.
// Корисне посилання для відображення годин та хвилин у потрібному форматі ('01' замість '1'):
// https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String/padStart#examples

/* const minutes = Number(prompt("input minutes"));
const hours = Math.floor(minutes / 60);
const remainMinutes = minutes % 60;
console.log(
  `${String(hours).padStart(2, "0")}:${String(remainMinutes).padStart(2, "0")}`,
); */

//+++++++++++++++++++Task 5 +++++++++++++++++++
// Напишіть код, який запитуватиме у користувача
// логін за допомогою prompt і виводить результат в консоль браузера

// Після цього додайте перевірку введеного користувачем значення:
// Якщо відвідувач вводить "Адмін",
// то prompt запитує пароль (не забудьте зберігти його у змінну для подальшої перевірки).
// Якщо нічого не ввели або натиснули Cancel,
// Вивести в alert строку "Скасовано"
// В іншому випадку вивести в alert рядок "Я вас не знаю"

// Пароль перевіряти так:
// Якщо введено пароль "Я головний",
// то вивести в alert рядок "Добрий день!",
// в іншому випадку вивести в alert рядок "Невірний пароль!"

/* const login = prompt("input login");
if (login === "Admin") {
  const password = prompt("Admin");
  if (password === "boss") {
    alert("Hello");
  } else if (password === null || password === "") {
    alert("Esc");
  } else {
    alert("Mist");
  }
} else if (login === nul || login === "") {
  alert("Esc");
} else {
  alert("I know you");
} */

//+++++++++++++++++++Task 6 +++++++++++++++++++
// Використайте цикл while, щоб вивести в console всі числа від 0 до 20 включно.
/* let counter = 0;
while (counter <= 10) {
  counter++;
  console.log(`${counter}`);
} */

//+++++++++++++++++++Task 7 +++++++++++++++++++
// Напишіть функцію getNumbers(min, max), що приймає 2 параметри -
// мінімальне і максимальне число відповідно.
// Напишіть цикл всередині функції, який виводить у консоль
// всі числа від max до min за спаданням.
// Окрім цього, підрахуйте суму всіх парних чисел в цьому циклі
// і поверніть її з функції.
/* function getNumbers(min, max) {
  let sum = 0;
  for (let i = max; i >= min; i--) {
    console.log(i);
    if (i % 2 === 0) {
      sum = +i;
    }
  }
  return sum;
} */

//+++++++++++++++++++Task 8 +++++++++++++++++++
// Напишіть функцію min(a, b), яка приймає 2 числа і повертає меньше з них.
// Потрібно додати перевірку, що функція отримує саме числа, в іншому випадку
// повертати з функції рядок - 'Not a number!'.

/* function min(a, b) {
  if (typeof a == "number" || typeof b !== "number") return "Not a number";
  return a < b ? a : b;
}
console.log(min(6, 10)); */

//+++++++++++++++++++Task 9 +++++++++++++++++++
// Напишіть функцію isAdult(age), яка  приймає число - вік користувача і повертає true,
// якщо параметр age більше чи дорівнює 18.
// В іншому випадку вона запитує підтвердження через confirm
// і повертає його результат (true/false).

/* function isAdult(age) {
  if (age >= 18) {
    return true;
  } else {
    return confirm("Are you adult?");
  }
}
console.log(isAdult(19)); */

//+++++++++++++++++++Task 10 +++++++++++++++++++
// Напишіть функцію fizzBuzz(num), яка приймає число і перевіряє кожне число від 1 до num:
// Якщо число ділитися  без остачі на 3 - виводить в консоль 'fizz',
// якщо ділиться  без остачі на 5 - виводить в консоль 'buzz',
// якщо ділиться  без остачі і на 3, і на 5 - виводить в консоль 'fizzbuzz'.

/* function fizzBuzz(num) {
  for (let i = 1; i <= num; i++) {
    // 1. Перевіряємо ділення на 15 (3 * 5)
    if (i % 3 === 0 && i % 5 === 0) {
      console.log("fizzbuzz");
    }
    // 2. Перевіряємо тільки на 3
    else if (i % 3 === 0) {
      console.log("fizz");
    }
    // 3. Перевіряємо тільки на 5
    else if (i % 5 === 0) {
      console.log("buzz");
    }
    // 4. Якщо не підходить під умови, виводимо саме число (опціонально)
    else {
      console.log(i);
    }
  }
}

console.log(fizzBuzz(16));
 */

//+++++++++++++++++++ Додатковий Task 1================
// Напишіть цикл, який пропонує ввести
// число більше 100 через prompt.
// Якщо користувач ввів інше число - попросити
// ввести ще раз.
// Цикл повинен питати число, доки користувач не
// введе число більше 100, чи не натисне кнопку
// Cancel в prompt

/* let num;

do {
  num = prompt("Будь ласка, введіть число більше 100:", "");
} while (num !== null && num <= 100);

// Після циклу перевіряємо, що саме сталося
if (num === null) {
  console.log("Користувач скасував введення.");
} else {
  console.log("Дякую! Ви ввели: " + num);
} */

//+++++++++++++++++++ Додатковий Task 2================
// Напишіть функцію, яка приймає адресу сайта url та перевіряє чи закінчується значення
// параметра символом /. Якщо ні, додайте до кінця
// значення url цей символ і поверніть оновлене значення з функції, але тільки в тому випадку,
// якщо в url є підрядок "my-site".
// В іншому випадку поверніть з функції адресу в незмінному вигляді

// const url = "https://my-site.com/about";

function checkUrl(url) {
  // 1. Спочатку перевіряємо, чи містить адреса підрядок "my-site"
  if (url.includes("my-site")) {
    // 2. Якщо так, перевіряємо, чи НЕ закінчується вона на "/"
    if (!url.endsWith("/")) {
      // Додаємо слеш і повертаємо оновлений рядок
      return url + "/";
    }
  }

  // 3. В усіх інших випадках повертаємо url без змін
  return url;
}
